app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]
---
	def create
	  @schoolclass = SchoolClass.new
	  @schoolclass.title = params[:title]
	  @schoolclass.room_number = params[:room_number]
	  @schoolclass.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
	def update
	  @schoolclass = SchoolClass.find(params[:id])
	  @schoolclass.update(params.require(:schoolclass))