app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-11-09 02:02:44.143667"], ["updated_at", "2017-11-09 02:02:44.143667"]]
---
	def create
	 @student = Student.new
	 @student.first_name = params[:first_name]
	 @student.last_name = params[:last_name]
	 @student.save

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-11-09 02:04:31.880532"], ["id", 1]]
---
	def update
	  @student = SchoolClass.find(params[:id])
	  @student.update(params.require(:schoolclass))